In [ ]:
# 导入数据
import pandas as pd
df = pd.read_csv('data/employees.csv')
df
# 数据的导出
# df = df.tail()
# df.to_csv('data/new.csv')

,employee_id,first_name,last_name,email,phone_number,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,AD_PRES,24000.0,NaN,NaN,90.0
1,101,N_ann,Kochhar,NKOCHHAR,515.123.4568,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,IT_PROG,6000.0,NaN,103.0,60.0
...,...,...,...,...,...,...,...,...,...,...
102,202,Pat,Fay,PFAY,603.123.6666,MK_REP,6000.0,NaN,201.0,20.0
103,203,Susan,Mavris,SMAVRIS,515.123.7777,HR_REP,6500.0,NaN,101.0,40.0
104,204,Hermann,Baer,HBAER,515.123.8888,PR_REP,10000.0,NaN,101.0,70.0
105,205,Shelley,Higgins,SHIGGINS,515.123.8080,AC_MGR,12000.0,NaN,101.0,110.0
106,206,William,Gietz,WGIETZ,515.123.8181,AC_ACCOUNT,8300.0,NaN,205.0,110.0

In [6]:
# Json 数据的导入
# df = pd.read_json('data/test.json')
import json
with open('data/test.json') as f:
    data = json.load(f)

# print(data)
# print(type(data))
df = pd.DataFrame(data['users'])
df

   id name  age                 email  is_active   join_date
0   1   张三   28  zhangsan@example.com       True  2022-03-15
1   2   李四   35      lisi@example.com      False  2021-11-02
2   3   王五   24    wangwu@example.com       True  2023-01-20

In [ ]:
# 缺失值处理
import numpy as np
import pandas as pd
data = {
    "姓名": ["张三", "李四", None, "王五", "赵六", "钱七", "孙八"],
    "年龄": [18, None, 19, 20, 18, None, 19],
    "数学成绩": [90, 85, 78, None, 92, 88, 76],
    "语文成绩": [88, 92, None, 85, 90, 87, 89]
}
df = pd.DataFrame(data)
print("=== 原始数据集 ===")
df
print("========统计每列缺失值的数量=========")
print(df.isnull().sum())
print("=========快速查看数据概况==========")
df.info()

=== 原始数据集 ===
========统计每列缺失值的数量=========
姓名      1
年龄      2
数学成绩    1
语文成绩    1
dtype: int64
=========快速查看数据概况==========
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   姓名      6 non-null      object
 1   年龄      5 non-null      float64
 2   数学成绩    6 non-null      float64
 3   语文成绩    6 non-null      float64
dtypes: float64(3), object(1)
memory usage: 356.0+ bytes
========剔除缺失值后的数据==========
   姓名    年龄  数学成绩  语文成绩
0  张三  18.0  90.0  88.0
4  赵六  18.0  92.0  90.0
6  孙八  19.0  76.0  89.0

In [ ]:
# 剔除缺失值
## 方式1：剔除任意一列有缺失值的行（最常用） 
print("========剔除缺失值后的数据==========")
df_drop_any = df.dropna(how="any")# how="any"：只要行中有1个缺失值就删除
df_drop_any

========剔除缺失值后的数据==========
   姓名    年龄  数学成绩  语文成绩
0  张三  18.0  90.0  88.0
4  赵六  18.0  92.0  90.0
6  孙八  19.0  76.0  89.0

In [17]:
## 方式2：仅剔除“姓名”列有缺失值的行（指定列剔除，更灵活）
df_drop_subset = df.dropna(subset=["数学成绩"])
print("\n=== 仅剔除姓名列有缺失值后的数据集 ===")
df_drop_subset

=== 仅剔除姓名列有缺失值后的数据集 ===

     姓名    年龄  数学成绩  语文成绩
0    张三  18.0  90.0  88.0
1    李四   NaN  85.0  92.0
2  None  19.0  78.0   NaN
4    赵六  18.0  92.0  90.0
5    钱七   NaN  88.0  87.0
6    孙八  19.0  76.0  89.0

In [18]:
print("\n=== 验证：剔除后数据的缺失值数量 ===")
print(df_drop_any.isnull().sum())

=== 验证：剔除后数据的缺失值数量 ===
姓名      0
年龄      0
数学成绩    0
语文成绩    0
dtype: int64

In [2]:
# 处理重复值
import pandas as pd

# 1. 构造带重复值的示例数据（模拟电商订单数据）
data = {
    "订单号": ["001", "002", "001", "003", "002", "004", "005", "005"],
    "用户ID": ["U001", "U002", "U001", "U003", "U002", "U004", "U005", "U005"],
    "商品": ["手机", "电脑", "手机", "平板", "电脑", "耳机", "手表", "手表"],
    "金额": [5999, 7999, 5999, 2999, 7999, 399, 1999, 1999],
    "支付时间": ["2026-02-01 10:00", "2026-02-01 11:00", "2026-02-01 10:00",
                "2026-02-01 12:00", "2026-02-01 11:00", "2026-02-01 13:00",
                "2026-02-01 14:00", "2026-02-01 14:01"]  # 005订单有2条，仅时间差1分钟
}
df = pd.DataFrame(data)
# 识别重复值
df["是否重复值"] = df.duplicated()
#df
# 统计重复值数量（按所有列）
duplicate_count = df.duplicated().sum()
print(f"\n=== 所有列完全重复的行数：{duplicate_count} ===")

=== 所有列完全重复的行数：0 ===

In [3]:
# 按指定列判断重复
df["订单号是否重复"] = df.duplicated(subset=["订单号"])
df[["订单号","用户ID","商品","订单号是否重复"]]

   订单号  用户ID  商品  订单号是否重复
0  001  U001  手机    False
1  002  U002  电脑    False
2  001  U001  手机     True
3  003  U003  平板    False
4  002  U002  电脑     True
5  004  U004  耳机    False
6  005  U005  手表    False
7  005  U005  手表     True

In [ ]:
# 删除所有列完全重复的行(只保留首次出现)
df_drop_all = df.drop_duplicates()
df_drop_all

   订单号  用户ID  商品    金额              支付时间  是否重复值  订单号是否重复
0  001  U001  手机  5999  2026-02-01 10:00  False    False
1  002  U002  电脑  7999  2026-02-01 11:00  False    False
2  001  U001  手机  5999  2026-02-01 10:00   True     True
3  003  U003  平板  2999  2026-02-01 12:00  False    False
4  002  U002  电脑  7999  2026-02-01 11:00   True     True
5  004  U004  耳机   399  2026-02-01 13:00  False    False
6  005  U005  手表  1999  2026-02-01 14:00  False    False
7  005  U005  手表  1999  2026-02-01 14:01  False     True

In [7]:
# 按指定列删除重复
df_drop_order = df.drop_duplicates(subset=["订单号"])
df_drop_order[["订单号","用户ID","支付时间","订单号是否重复"]]

   订单号  用户ID              支付时间  订单号是否重复
0  001  U001  2026-02-01 10:00    False
1  002  U002  2026-02-01 11:00    False
3  003  U003  2026-02-01 12:00    False
5  004  U004  2026-02-01 13:00    False
6  005  U005  2026-02-01 14:00    False

In [11]:
# 按指定列去重，保留最后一次出现的行（比如保留最新支付时间)
df_drop_last = df.drop_duplicates(subset=["订单号"],keep="last")
df_drop_last[["订单号","用户ID","支付时间","订单号是否重复"]]

   订单号  用户ID              支付时间  订单号是否重复
2  001  U001  2026-02-01 10:00     True
3  003  U003  2026-02-01 12:00    False
4  002  U002  2026-02-01 11:00     True
5  004  U004  2026-02-01 13:00    False
7  005  U005  2026-02-01 14:01     True

In [12]:
# 彻底删除所有重复行（包括首次出现的，仅保留唯一行）
df_drop_all_duplicate = df.drop_duplicates(subset=["订单号"],keep=False)
df_drop_all_duplicate

   订单号  用户ID  商品    金额              支付时间  是否重复值  订单号是否重复
3  003  U003  平板  2999  2026-02-01 12:00  False    False
5  004  U004  耳机   399  2026-02-01 13:00  False    False

In [14]:
# 数据类型的转换
import pandas as pd

data  = pd.read_csv('data/sleep.csv')
df = pd.DataFrame(data)
df

,person_id,gender,age,occupation,sleep_duration,sleep_quality,physical_activity_level,stress_level,bmi_category,blood_pressure,heart_rate,daily_steps,sleep_disorder
0,1,Male,29,Manual Labor,7.4,7.0,41,7,Obese,124/70,91,8539,NaN
1,2,Female,43,Retired,4.2,4.9,41,5,Obese,131/86,81,18754,NaN
2,3,Male,44,Retired,6.1,6.0,107,4,Underweight,122/70,81,2857,NaN
3,4,Male,29,Office Worker,8.3,10.0,20,10,Obese,124/72,55,6886,NaN
4,5,Male,67,Retired,9.1,9.5,19,4,Overweight,133/78,97,14945,Insomnia
...,...,...,...,...,...,...,...,...,...,...,...,...,...
395,396,Female,36,Student,4.5,7.9,73,7,Normal,118/66,64,14497,Sleep Apnea
396,397,Female,45,Manual Labor,6.0,6.1,72,8,Obese,132/80,65,12848,Insomnia
397,398,Female,30,Student,5.3,6.5,58,10,Obese,125/76,66,15255,Insomnia
398,399,Female,41,Retired,11.0,9.1,73,9,Obese,130/75,75,6567,Sleep Apnea
399,400,Male,37,Retired,5.8,7.0,41,6,Normal,118/70,51,18079,NaN

In [16]:
df['age'] = df['age'].astype('int16')
df['is_male'] = df['gender'].map({'Female':True,'Male':False})

In [17]:
# 数据变形
import pandas as pd

# 1. 构造初始宽表数据（模拟月度销售数据）
# 宽表特点：列是类别（月份），行是维度（产品+地区）
data = {
    "产品": ["手机", "手机", "电脑", "电脑"],
    "地区": ["华东", "华北", "华东", "华北"],
    "1月销量": [500, 300, 200, 150],
    "2月销量": [550, 320, 210, 160],
    "3月销量": [600, 350, 220, 170]
}
df_wide = pd.DataFrame(data)
df_wide

   产品  地区  1月销量  2月销量  3月销量
0  手机  华东   500   550   600
1  手机  华北   300   320   350
2  电脑  华东   200   210   220
3  电脑  华北   150   160   170

In [ ]:
# 宽表转长表（melt）：把多列（月份）转为“键-值”对
df_long = df_wide.melt(
    id_vars=["产品", "地区"],  # 保留不变的标识列
    value_vars=["1月销量", "2月销量", "3月销量"],  # 要“拉长”的列
    var_name="月份",  # 原列名转为新列的名称
    value_name="销量"  # 原列值转为新列的名称
)
df_long

    产品  地区    月份   销量
0   手机  华东  1月销量  500
1   手机  华北  1月销量  300
2   电脑  华东  1月销量  200
3   电脑  华北  1月销量  150
4   手机  华东  2月销量  550
5   手机  华北  2月销量  320
6   电脑  华东  2月销量  210
7   电脑  华北  2月销量  160
8   手机  华东  3月销量  600
9   手机  华北  3月销量  350
10  电脑  华东  3月销量  220
11  电脑  华北  3月销量  170

In [22]:
# 长表转宽表（pivot）：把“键-值”对转回多列
df_pivot = df_long.pivot(
    index=["产品","地区"],
    columns=["月份"],# 列维度（把“月份”的不同值转为列）
    values=["销量"]# 填充到单元格的值
).reset_index()
df_pivot.columns.name = None
df_pivot

    产品  地区   销量
月份         1月销量 2月销量 3月销量
0   手机  华东  500  550  600
1   手机  华北  300  320  350
2   电脑  华东  200  210  220
3   电脑  华北  150  160  170

In [26]:
# 行列转置（T）：行和列互换（适合快速调整数据展示形式）
df_transpose = df_wide.set_index(["产品","地区"]).T
df_transpose

产品     手机        电脑
地区     华东   华北   华东   华北
1月销量  500  300  200  150
2月销量  550  320  210  160
3月销量  600  350  220  170

In [28]:
#进阶：pivot_table（处理重复值的长表转宽）
# 构造带重复值的长表（模拟同一产品+地区+月份有2条销量记录）
df_long_dup = pd.concat([df_long, pd.DataFrame({
    "产品": ["手机", "电脑"],
    "地区": ["华东", "华北"],
    "月份": ["1月销量", "2月销量"],
    "销量": [50, 20]
})], ignore_index=True)
#df_long_dup
## 用pivot_table聚合重复值（比如求和）
df_pivot_table = df_long_dup.pivot_table(
    index=["产品","地区"],
    columns=["月份"],
    values=["销量"],
    aggfunc=sum
) .reset_index()
df_pivot_table

C:\Users\Administrator\AppData\Local\Temp\ipykernel_8\4119727816.py:11: FutureWarning: The provided callable <built-in function sum> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df_pivot_table = df_long_dup.pivot_table(

    产品  地区   销量
月份         1月销量 2月销量 3月销量
0   手机  华东  550  550  600
1   手机  华北  300  320  350
2   电脑  华东  200  210  220
3   电脑  华北  150  180  170

In [38]:
df = pd.read_csv("data/sleep.csv") 
df[['Hight','Low']]= df['blood_pressure'].str.split('/',expand=True)
df[['Hight','Low']] = df[['Hight','Low']].astype('int16')
df.dtypes

person_id                    int64
gender                      object
age                          int64
occupation                  object
sleep_duration             float64
sleep_quality              float64
physical_activity_level      int64
stress_level                 int64
bmi_category                object
blood_pressure              object
heart_rate                   int64
daily_steps                  int64
sleep_disorder              object
Hight                        int16
Low                          int16
dtype: object